dreamted/TRIO_MR_MD/3.TRIO-MD/2_1G Clearing/TRIO_MD_appl_stm207_20150327_20150518/STM32F2xx_StdPeriph_Driver_v1212/src/stm32f2xx_usart3_1208.c
	if(((nLCR >> 0) & 0x03) == (_NONPARITY >> 0)){
		USART_InitStructure.USART_Parity = USART_Parity_No;
	}
	else if(((nLCR >> 0) & 0x03) == (_ODDPARITY >> 0)){
		USART_InitStructure.USART_Parity = USART_Parity_Odd;
	}
	else{
		USART_InitStructure.USART_Parity = USART_Parity_Even;
	}
	
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;

	/* USART configuration */
	USART_Init(USART3, &USART_InitStructure);

#if defined (OS_INCLUDED) 
	pUSART3.sem = OSSemCreate(1);
#endif
	/* Enable USART */
	USART_Cmd(USART3, ENABLE);

	USART_ITConfig(USART3, USART_IT_RXNE, ENABLE);
	NVIC_Init(USART3_IRQn, ENABLE); 

	USART3Printf("\n");	
}

/*******************************************************************************
  * @brief  Interrupt handler USART3 global interrupt request
  * @param  None 
  * @retval None
  *****************************************************************************/
void USART3_IRQIntHandler(void)
{

	INT16U tmp = USART3->SR;

#ifdef OS_INCLUDED
	INT32U cpu_sr;
	CPU_CRITICAL_ENTER();                                       // Tell uC/OS-II that we are starting an ISR
	OSIntNesting++;
	CPU_CRITICAL_EXIT();
#endif /* OS_INCLUDED */
	// Rx Data Received
	if(tmp & ( 1 << __RXNE))
	{
		Rx3Buff[Rx3WrCnt%Rx3BuffLen] = USART3->DR;		// When the receive register is read, the RDR bit is automatically cleared.
		if(++Rx3WrCnt >= Rx3BuffLen) Rx3WrCnt = 0;
	}
	else if(tmp & ( 1 << __TXE))
	{
		if(Tx3RdCnt != Tx3WrCnt)
		{
			USART3->DR = Tx3Buff[Tx3RdCnt%Tx3BuffLen];
			if(++Tx3RdCnt >= Tx3BuffLen ) Tx3RdCnt = 0;
		}
		else USART3->__B.CR1.TXEIE = DISABLE;
	}
	else // error, dummy read
	{
		tmp =  USART3->DR;
	}

#ifdef OS_INCLUDED
	OSIntExit();												// Tell uC/OS-II that we are leaving the ISR
#endif /* OS_INCLUDED */

}

unsigned char USART3PutToBuffer(unsigned char Data)
{
#ifdef OS_INCLUDED
	INT8U err;
	//////////////////////////////////////////////////

	OSSemPend(pUSART3.sem, 0, &err);
#endif /* OS_INCLUDED */
	//////////////////////////////////////////////////
	Tx3Buff[Tx3WrCnt%Tx3BuffLen] = Data;
	if(++Tx3WrCnt >= Tx3BuffLen) Tx3WrCnt = 0;
	
	USART3->__B.CR1.TXEIE = ENABLE; 		
	///////////////////////////////////////////////////
#ifdef OS_INCLUDED
	OSSemPost(pUSART3.sem);
#endif /* OS_INCLUDED */

	return 0;
}



//Not using interrupt
unsigned char USART3PutChar(unsigned char Data)
{
	#ifdef OS_INCLUDED
		INT8U err;
		//////////////////////////////////////////////////
	
		OSSemPend(pUSART3.sem, 0, &err);
	#endif /* OS_INCLUDED */
		USART3->__B.DR.DR = Data;
		while(!USART3->__B.SR.TXE);
	#ifdef OS_INCLUDED
		OSSemPost(pUSART3.sem);
	#endif /* OS_INCLUDED */
	return Data;
}

unsigned long int USART3Printf( const char *format, ...)
{
	unsigned long int i, cnt;
//	char buf[128];
	char *buf = (char *)&Tx3Buff[Tx3BuffLen-256];
	
	va_list argptr;

	va_start(argptr, format);
	cnt = vsprintf(buf, format, argptr);
	va_end( argptr );

	for(i = 0;;i++)
	{
		if(buf[i] == 0) break;
		if(buf[i] == '\n') USART3PutToBuffer('\r');
		USART3PutToBuffer(buf[i]);
	}
	while(!USART3TxCheckByte())
	{
#ifdef OS_INCLUDED
	OSTimeDly(1);
#endif /* OS_INCLUDED */
	}
	return cnt;
}

//#define OS_INCLUDED

void USART3PutStr(unsigned char *Str, unsigned short int Length, int iEn)
{
	u32 i = 0;

	USART3BuffClear();
	
#ifdef OS_INCLUDED
	INT8U err;
	OSSemPend(pUSART3.sem, 0, &err);
#endif /* OS_INCLUDED */


	for(i = 0; i < Length; i++)
	{
		Tx3Buff[Tx3WrCnt++] = Str[i];
		if(Tx3WrCnt >= Tx3BuffLen) Tx3WrCnt = 0;
	}

	if(iEn)
	{
		USART3->__B.CR1.TXEIE = ENABLE;
	}	
#ifdef OS_INCLUDED
		OSSemPost(pUSART3.sem);
#endif /* OS_INCLUDED */
}

signed short int USART3RxGetByte(void)
{
	s16 RetVal = 0;

#ifndef OS_INCLUDED
	while(Rx3RdCnt == Rx3WrCnt);
#else
	if(Rx3RdCnt == Rx3WrCnt) return -1;
#endif

	RetVal = Rx3Buff[Rx3RdCnt%Rx3BuffLen];
	if(++Rx3RdCnt >= Rx3BuffLen) Rx3RdCnt = 0;

	return (RetVal & 0xff);
}

unsigned char USART3CheckByte(unsigned short int ByteCnt, unsigned short int *Recv)
{
	u32 i = 0, j = 0;
	u8 RetVal = TRUE;

	*Recv = 0;
	i = (u32) Rx3RdCnt;
	j = (u32) Rx3WrCnt;

	if(i == j) RetVal = FALSE;
	else if(i < j)
	{
		*Recv = j - i;
		i = i + ByteCnt;
		if(i > j) RetVal = FALSE;
	}
	else if(i > j)
	{
		*Recv = (Rx3BuffLen +j) - i;
		i = i + ByteCnt;
		j = j + Rx3BuffLen;
		if(i > j) RetVal = FALSE; 
	}
	return (RetVal);
}

void USART3BuffClear(void)
{
	Rx3RdCnt = 0;
	Rx3WrCnt = 0;
	Tx3RdCnt = 0;
	Tx3WrCnt = 0;
}

void USART3TxClear(void)
{
	Tx3RdCnt = 0;
	Tx3WrCnt = 0;
}

/*******************************************************************************
  * @brief  if the bytes have been transmitted, retrun true or not
  * @param  None
  * @retval TRUE/FALSE
  ******************************************************************************/

signed short int USART3TxCheckByte(void)
{
	if(Tx3RdCnt == Tx3WrCnt) return TRUE;
	else return FALSE;
}




/**
  * @brief  Initializes the USARTx peripheral Clock according to the 
  *         specified parameters in the USART_ClockInitStruct .
  * @param  USARTx: where x can be 1, 2, 3 or 6 to select the USART peripheral.
  * @param  USART_ClockInitStruct: pointer to a USART_ClockInitTypeDef structure that
  *         contains the configuration information for the specified  USART peripheral.
  * @note   The Smart Card and Synchronous modes are not available for UART4 and UART5.    
  * @retval None
  */

/**
  * @brief  Fills each USART_ClockInitStruct member with its default value.
  * @param  USART_ClockInitStruct: pointer to a USART_ClockInitTypeDef structure
  *         which will be initialized.
  * @retval None
  */


/**
  * @brief  Enables or disables the specified USART peripheral.
  * @param  USARTx: where x can be 1, 2, 3, 4, 5 or 6 to select the USART or 
  *         UART peripheral.
  * @param  NewState: new state of the USARTx peripheral.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */


/**
  * @brief  Sets the system clock prescaler.
  * @param  USARTx: where x can be 1, 2, 3, 4, 5 or 6 to select the USART or 
  *         UART peripheral.
  * @param  USART_Prescaler: specifies the prescaler clock. 
  * @note   The function is used for IrDA mode with UART4 and UART5.   
  * @retval None
  */

/**
  * @brief  Enables or disables the USART's 8x oversampling mode.
  * @note   This function has to be called before calling USART_Init() function
  *         in order to have correct baudrate Divider value.
  * @param  USARTx: where x can be 1, 2, 3, 4, 5 or 6 to select the USART or 
  *         UART peripheral.
  * @param  NewState: new state of the USART 8x oversampling mode.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
  

/**
  * @brief  Enables or disables the USART's one bit sampling method.
  * @param  USARTx: where x can be 1, 2, 3, 4, 5 or 6 to select the USART or 
  *         UART peripheral.
  * @param  NewState: new state of the USART one bit sampling method.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */

/**
  * @}
  */

